src/cf/src/Documents/УстановкаЦенНоменклатурыВручную/УстановкаЦенНоменклатурыВручную.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНоменклатурыВручную</name>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧЦены</name>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/УстановкаЦенНоменклатурыВручную/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НомерСтраницы = 1;
	ПрименитьСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Состояние панели сведений восстанавливается из сохранённых данных формы.
	ПрименитьСостояниеПанели();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)

	ПрименитьОтборы();

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	// Отложенно: при листании стрелками не дёргать сервер на каждую строку.
	// BSLLS:MagicNumber-off - треть секунды, константа имени не добавит.
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСведения", 0.3, Истина);
	// BSLLS:MagicNumber-on

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСведения()

	Ссылка = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.УстановкаЦенНоменклатурыВручную") Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьСведения(Ссылка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьПанель(Команда)

	ПанельСвернута = Истина;
	ПрименитьСостояниеПанели();

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьПанель(Команда)

	ПанельСвернута = Ложь;
	ПрименитьСостояниеПанели();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФильтры(Команда)

	ОткрытьСтраницуПанели("СтраницаФильтры");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДетали(Команда)

	ОткрытьСтраницуПанели("СтраницаИнфо");

КонецПроцедуры

&НаКлиенте
Процедура СтраницаНазад(Команда)

	Если НомерСтраницы > 1 Тогда
		НомерСтраницы = НомерСтраницы - 1;
		ПрименитьСтраницу();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаВперед(Команда)

	Если НомерСтраницы < ВсегоСтраниц Тогда
		НомерСтраницы = НомерСтраницы + 1;
		ПрименитьСтраницу();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Свёрнутая панель - столбик значков, развёрнутая - закладки со страницами.
// Значок открывает панель сразу на своей странице, как в УНФ.
//
&НаКлиенте
Процедура ПрименитьСостояниеПанели()

	Элементы.ГруппаПанельЗначки.Видимость = ПанельСвернута;
	Элементы.ГруппаПодвалПанели.Видимость = Не ПанельСвернута;
	Элементы.ГруппаСтраницыСведений.Видимость = Не ПанельСвернута;

КонецПроцедуры

// Разворачивает панель и активирует страницу по имени.
//
// Параметры:
//  ИмяСтраницы - Строка - имя страницы панели сведений
//
&НаКлиенте
Процедура ОткрытьСтраницуПанели(ИмяСтраницы)

	ПанельСвернута = Ложь;
	ПрименитьСостояниеПанели();
	Элементы.ГруппаСтраницыСведений.ТекущаяСтраница = Элементы[ИмяСтраницы];

КонецПроцедуры

// Ставит либо снимает отборы динамического списка по полям правой панели.
// Отборы программные: пользовательские настройки списка их не перетирают.
//
&НаСервере
Процедура ПрименитьОтборы()

	Отборы = Новый Структура;
	Отборы.Вставить("Ответственный", ОтборОтветственный);

	Для Каждого Отбор Из Отборы Цикл
		УстановитьОтборПоПолю(Отбор.Ключ, Отбор.Значение);
	КонецЦикла;

	УстановитьОтборПоПолю("Сумма", ОтборСумма, ВидСравненияУсловия(ОтборСуммаУсловие));

	НомерСтраницы = 1;
	ПрименитьСтраницу();

КонецПроцедуры

// Вид сравнения отбора по позиции тумблера знака.
//
// Параметры:
//  Позиция - Число - 0 - больше, 1 - меньше, 2 - равно
//
// Возвращаемое значение:
//  ВидСравненияКомпоновкиДанных
//
&НаСервере
Функция ВидСравненияУсловия(Позиция)

	// BSLLS:MagicNumber-off - значения объявлены списком выбора тумблера знака.
	Если Позиция = 1 Тогда
		Возврат ВидСравненияКомпоновкиДанных.Меньше;
	ИначеЕсли Позиция = 2 Тогда
		Возврат ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		Возврат ВидСравненияКомпоновкиДанных.Больше;
	КонецЕсли;
	// BSLLS:MagicNumber-on

КонецФункции

// Знак сравнения для текста запроса по позиции тумблера знака.
//
// Параметры:
//  Позиция - Число - 0 - больше, 1 - меньше, 2 - равно
//
// Возвращаемое значение:
//  Строка
//
&НаСервере
Функция ЗнакУсловия(Позиция)

	// BSLLS:MagicNumber-off - значения объявлены списком выбора тумблера знака.
	Если Позиция = 1 Тогда
		Возврат "<";
	ИначеЕсли Позиция = 2 Тогда
		Возврат "=";
	Иначе
		Возврат ">";
	КонецЕсли;
	// BSLLS:MagicNumber-on

КонецФункции

// Один программный элемент отбора списка: значение пусто - элемент снимается.
// Список значений отбирается видом сравнения «В списке».
//
// Параметры:
//  Поле         - Строка       - имя поля динамического списка
//  Значение     - Произвольный - отбираемое значение или СписокЗначений
//  ВидСравнения - ВидСравненияКомпоновкиДанных, Неопределено - вид сравнения;
//                 не задан - «Равно» («В списке» для списка значений)
//
&НаСервере
Процедура УстановитьОтборПоПолю(Поле, Значение, ВидСравнения = Неопределено)

	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Поле);

	Найденный = Неопределено;
	Для Каждого Элемент Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных")
			И Элемент.ЛевоеЗначение = ПолеКомпоновки Тогда
			Найденный = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	ЗначениеПусто = Не ЗначениеЗаполнено(Значение);
	Если ЗначениеПусто Тогда
		Если Найденный <> Неопределено Тогда
			Список.Отбор.Элементы.Удалить(Найденный);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Если Найденный = Неопределено Тогда
		Найденный = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Найденный.ЛевоеЗначение = ПолеКомпоновки;
	КонецЕсли;
	Если ВидСравнения <> Неопределено Тогда
		Найденный.ВидСравнения = ВидСравнения;
	ИначеЕсли ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		Найденный.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		Найденный.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	Найденный.ПравоеЗначение = Значение;
	Найденный.Использование = Истина;

КонецПроцедуры

// Постраничный просмотр: список ограничивается ссылками текущей страницы,
// счётчик «N / M» считается тем же набором условий, что и отборы панели.
// Страницы режутся по дате от новых к старым.
//
&НаСервере
Процедура ПрименитьСтраницу()

	// BSLLS:MagicNumber-off - размер страницы, используется только здесь.
	РазмерСтраницы = 50;
	// BSLLS:MagicNumber-on

	Условия = Новый Массив;
	Запрос = Новый Запрос;

	Если ЗначениеЗаполнено(ОтборОтветственный) Тогда
		Условия.Добавить("Док.Ответственный = &Ответственный");
		Запрос.УстановитьПараметр("Ответственный", ОтборОтветственный);
	КонецЕсли;
	Если ОтборСумма <> 0 Тогда
		Условия.Добавить("Док.Сумма " + ЗнакУсловия(ОтборСуммаУсловие) + " &СуммаОтбора");
		Запрос.УстановитьПараметр("СуммаОтбора", ОтборСумма);
	КонецЕсли;

	ТекстУсловий = "";
	Если Условия.Количество() > 0 Тогда
		ТекстУсловий = "
			|ГДЕ
			|	" + СтрСоединить(Условия, "
			|	И ");
	КонецЕсли;

	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Док.Ссылка) КАК Всего
		|ИЗ
		|	Документ.УстановкаЦенНоменклатурыВручную КАК Док" + ТекстУсловий;
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = 0;
	Если Выборка.Следующий() Тогда
		Всего = Выборка.Всего;
	КонецЕсли;

	ВсегоСтраниц = Макс(1, Цел((Всего + РазмерСтраницы - 1) / РазмерСтраницы));
	НомерСтраницы = Макс(1, НомерСтраницы);
	НомерСтраницы = Мин(НомерСтраницы, ВсегоСтраниц);

	ПолеСсылки = "Ссылка";
	Если ВсегоСтраниц = 1 Тогда
		УстановитьОтборПоПолю(ПолеСсылки, Неопределено);
	Иначе
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ " + Формат(НомерСтраницы * РазмерСтраницы, "ЧГ=") + "
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.УстановкаЦенНоменклатурыВручную КАК Док" + ТекстУсловий + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	Док.Дата УБЫВ,
			|	Док.Ссылка";
		Ссылки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

		СсылкиСтраницы = Новый СписокЗначений;
		Для Индекс = (НомерСтраницы - 1) * РазмерСтраницы По Ссылки.ВГраница() Цикл
			СсылкиСтраницы.Добавить(Ссылки[Индекс]);
		КонецЦикла;
		УстановитьОтборПоПолю(ПолеСсылки, СсылкиСтраницы);
	КонецЕсли;

	Элементы.НадписьСтраницы.Заголовок = СтрШаблон("%1 / %2", НомерСтраницы, ВсегоСтраниц);
	Элементы.КнопкаСтраницаНазад.Доступность = НомерСтраницы > 1;
	Элементы.КнопкаСтраницаВперед.Доступность = НомерСтраницы < ВсегоСтраниц;

КонецПроцедуры

// Правая панель: сведения о документе текущей строки и его состав.
//
// Параметры:
//  Ссылка - ДокументСсылка.УстановкаЦенНоменклатурыВручную - текущая строка списка
//
&НаСервере
Процедура ЗаполнитьСведения(Знач Ссылка)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Док.Номенклатура КАК Номенклатура,
		|	Док.Ответственный КАК Ответственный
		|ИЗ
		|	Документ.УстановкаЦенНоменклатурыВручную КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ
		|	Строки.ВидЦены КАК ВидЦены,
		|	СУММА(Строки.Цена) КАК Сумма
		|ИЗ
		|	Документ.УстановкаЦенНоменклатурыВручную.ТЧЦены КАК Строки
		|ГДЕ
		|	Строки.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Строки.ВидЦены");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результаты = Запрос.ВыполнитьПакет();

	Шапка = Результаты[0].Выбрать();
	Если Не Шапка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	ФорматСуммы = "ЧДЦ=2; ЧРГ=''";

	// Страница «Детали»: реквизиты документа, не выведенные колонками списка.
	Строки = Новый Массив;
	Если ЗначениеЗаполнено(Шапка.Номенклатура) Тогда
		Шаблон = НСтр("ru = 'Номенклатура: %1'; fr = 'Article: %1'; en = 'Item: %1'; es = 'Artículo: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.Номенклатура)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.Ответственный) Тогда
		Шаблон = НСтр("ru = 'Ответственный: %1'; fr = 'Responsable: %1'; en = 'Responsible: %1'; es = 'Responsable: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.Ответственный)));
	КонецЕсли;
	ИнфоТекст = СтрСоединить(Строки, Символы.ПС);

	ТаблицаСостав.Очистить();
	Состав = Результаты[1].Выбрать();
	Пока Состав.Следующий() Цикл
		Строка = ТаблицаСостав.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Состав);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
